In [1]:
import pandas as pd

In [2]:
dict1 = {"a":1,"b":2,"c":3}
dict2 = {"a":11,"b":12,"c":13}
data = {"First":dict1,"second":dict2}

In [3]:
df = pd.DataFrame(data)
df

   First  second
a      1      11
b      2      12
c      3      13

In [4]:
type(df)

pandas.core.frame.DataFrame

In [6]:
d1 = df['First']

In [7]:
type(d1)

pandas.core.series.Series

### Reading a csv file

In [8]:
df1 = pd.read_csv("weather_data.csv")
df1

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017       -99999          7  Sunny
2  01-03-2017           28     -99999   Snow
3  01-04-2017       -99999          7      0
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [9]:
type(df1)

pandas.core.frame.DataFrame

In [10]:
df1['event']

0     Rain
1    Sunny
2     Snow
3        0
4     Rain
5    Sunny
6        0
Name: event, dtype: object

In [11]:
df1[['windspeed','event']]

   windspeed  event
0          6   Rain
1          7  Sunny
2     -99999   Snow
3          7      0
4     -99999   Rain
5          2  Sunny
6          5      0

### selecting data from the data frame

In [13]:
#loc ==> labels
df1.loc[0:2,'event']

0     Rain
1    Sunny
2     Snow
Name: event, dtype: object

In [14]:
#iloc ==> index
df1.iloc[:,3]

0     Rain
1    Sunny
2     Snow
3        0
4     Rain
5    Sunny
6        0
Name: event, dtype: object

### Retrieving the info of DF

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          7 non-null      object
 1   temperature  7 non-null      int64
 2   windspeed    7 non-null      int64
 3   event        7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [16]:
df1.shape

(7, 4)

In [17]:
df1.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [18]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [19]:
df1.describe()

        temperature     windspeed
count      7.000000      7.000000
mean  -28548.714286 -28567.285714
std    48809.837361  48797.150657
min   -99999.000000 -99999.000000
25%   -49985.500000 -49998.500000
50%       31.000000      5.000000
75%       32.000000      6.500000
max       34.000000      7.000000

### viewing data from the data frame

In [25]:
df1.head(2)

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017       -99999          7  Sunny

In [23]:
df1.tail(2)

          day  temperature  windspeed  event
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [46]:
df1.sample(3)

          day  temperature  windspeed event
0  01-01-2017           32          6  Rain
6  01-06-2017           34          5     0
2  01-03-2017           28     -99999  Snow

### Removing rows

In [47]:
df1

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017       -99999          7  Sunny
2  01-03-2017           28     -99999   Snow
3  01-04-2017       -99999          7      0
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [51]:
df1.drop([1,3],inplace=True)

In [52]:
df1

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
2  01-03-2017           28     -99999   Snow
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

### Removing columns

In [53]:
df1.drop(columns = ['event','day'])

   temperature  windspeed
0           32          6
2           28     -99999
4           32     -99999
5           31          2
6           34          5

### Finding NaN values

In [54]:
pd.isnull(df1)

     day  temperature  windspeed  event
0  False        False      False  False
2  False        False      False  False
4  False        False      False  False
5  False        False      False  False
6  False        False      False  False

In [55]:
pd.notnull(df1)

    day  temperature  windspeed  event
0  True         True       True   True
2  True         True       True   True
4  True         True       True   True
5  True         True       True   True
6  True         True       True   True

In [58]:
df1

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
2  01-03-2017           28     -99999   Snow
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [60]:
df1[df1['windspeed'] == -99999]

          day  temperature  windspeed event
2  01-03-2017           28     -99999  Snow
4  01-05-2017           32     -99999  Rain